Catalogs/ДоверенностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоверенностиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоверенностиКонтрагентов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ДатаНачала > ДатаОкончания И ЗначениеЗаполнено(ДатаОкончания) Тогда 
		
		Отказ = Истина;
		Сообщить("Дата начала действия доверенности не может быть больше даты окончания действия доверенности!");
		
	КонецЕсли;
	
	ЕстьОшибка = Ложь;
	
	Для Каждого Реквизит Из Метаданные.Справочники.ДоверенностиКонтрагентов.Реквизиты Цикл
		
		Если НЕ Реквизит.Имя = "Грузополучатель" И НЕ Реквизит.Имя = "Должность" 
			И НЕ Реквизит.Имя = "ДатаВыдачи" И НЕ Реквизит.Имя = "КемВыдана" И НЕ ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) Тогда		
			
			Сообщить("Не заполнен реквизит " + СокрЛП(Реквизит.Синоним) + " !", СтатусСообщения.Внимание);
			ЕстьОшибка = Истина;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Отказ = ЕстьОшибка; 	
	
	Если НЕ Отказ И СокрЛП(Наименование) = "Доверенность" Тогда
		Наименование = "Доверенность № " + Номер + " от " + Формат(ДатаВыдачи, "ДЛФ = Д");
	КонецЕсли;   

КонецПроцедуры
